{
  "speakers": [
    {
      "id": 187,
      "firstName": "Dave",
      "lastName": "Nielsen",
      "company": "Intel",
      "twitterHandle": "@davenielsen",
      "userBioShort": "As Head of Ecosystem Programs, Dave uses emerging technologies and open source projects like Microservices, Serverless & Kubernetes to bring the magic of Redis to the broader community.",
      "sessionIds": [
        7536
      ]
    },
    {
      "id": 1124,
      "firstName": "Douglas",
      "lastName": "Crockford",
      "company": "",
      "twitterHandle": "",
      "userBioShort": "Douglas Crockford discovered the JSON Data Interchange Format.",
      "sessionIds": [
        7489,
        7569
      ]
    },
    {
      "id": 1269,
      "firstName": "Arun",
      "lastName": "Gupta",
      "company": "Couchbase",
      "twitterHandle": "arungupta",
      "userBioShort": "Arun Gupta is a Principal Open Source Technologist at Amazon Web Services.",
      "sessionIds": [
        7486
      ]
    },
    {
      "id": 1530,
      "firstName": "Tammy",
      "lastName": "Baker",
      "company": "Code Camp",
      "twitterHandle": "tammybaker123",
      "userBioShort": "Tammy is a software development leader for over 20 years and as a Vice President of Engineering has lead teams of native-mobile, full stack, .Net and Java developers, QA and project management.",
      "sessionIds": [
        7566
      ]
    },
    {
      "id": 2920,
      "firstName": "Ron",
      "lastName": "Lichty",
      "company": "Ron Lichty Consulting, Inc.",
      "twitterHandle": "@RonLichty",
      "userBioShort": "Ron Lichty has been managing and, more recently, consulting in managing software development and product organizations for over 25 years.",
      "sessionIds": [
        7487,
        7537,
        7566
      ]
    },
    {
      "id": 8590,
      "firstName": "Chris",
      "lastName": "Richardson",
      "company": "Eventuate, Inc",
      "twitterHandle": "@crichardson",
      "userBioShort": "\nChris Richardson is a developer and architect.",
      "sessionIds": [
        7515
      ]
    },
    {
      "id": 10808,
      "firstName": "Antony",
      "lastName": "Ross",
      "company": "SportInsight",
      "twitterHandle": "@hisbiz",
      "userBioShort": "Antony Ross is a consultant specializing in data science and machine learning applied to sports performance.",
      "sessionIds": [
        7531
      ]
    },
    {
      "id": 47323,
      "firstName": "Jerry",
      "lastName": "Krikheli",
      "company": "Houzz",
      "twitterHandle": "digitaljerry",
      "userBioShort": "Jerry Krikheli is the VP of Engineering at Houzz where he oversees all infrastructure, platform, and engineering across Consumer, Marketplace, and Industry Solutions initiatives.",
      "sessionIds": [
        7526,
        7566
      ]
    }
  ],
  "sessions": [
    {
      "id": 7486,
      "title": "Using Kubernetes for Machine Learning Frameworks",
      "description": "Kubernetes provides isolation, auto-scaling, load balancing, flexibility and GPU support. These features are critical to run computationally, data intensive and hard to parallelize machine learning models. Declarative syntax of Kubernetes deployment descriptors make it easy for non-operationally focused engineers to easily train machine learning models on Kubernetes. This talk will explain why and how Kubernetes is well suited for single and multi node distributed training, deploying your machine learning models in production and setting up visualization tools like TensorBoard for monitoring. Specifically it will show how to setup a variety of open source machine learning frameworks such as TensorFlow, Apache MXNet and Pytorch on a Kubernetes cluster. The attendees will learn distributed training, massaging and inference phases of setting up a Machine Learning framework on Kubernetes. Attendees will leave with a GitHub repo of fully working samples."
    },
    {
      "id": 7487,
      "title": "What's It Take to Be a (Good!) Manager?",
      "description": "<p>Managing programmers is hard! Becoming a successful manager requires a drastic change of focus. <br /><br />The transition from programmer to manager is made particularly challenging by the dramatic difference between what made us successful as programmers and what it takes to successfully manage others. In addition, programmers are an interesting management challenge.<br />We tend to be free spirits, playful, curious, and (very) independent.<br /><br />For those programmers contemplating a leap to the &ldquo;dark side,&rdquo; here are a few questions to consider:<br />How can you ease the transition into management? Is management something you can &ldquo;try out&rdquo;? What&rsquo;s management really about? What will you give up? <br /><br />For programmers as well as managers already managing, here are a few more:<br />What differentiates success as a manager? What's it mean to manage in the era of agile? How do you prioritize?<br /><br />Presenter is Ron Lichty, who co-authored the Addison-Wesley tutorial and reference, Managing the Unmanageable: Rules, Tools, and Insights for Managing Software People and Teams - http://www.ManagingTheUnmanageable.net. Compared by reviewers to software development classics, The Mythical Man-Month and Peopleware, the content is now also available as video training, LiveLessons: Managing Software People and Teams, http://www.ManagingTheUnmanageable.net/video.html. Ron aspires to make software development better worldwide by advancing the practice of software development management.</p>"
    },
    {
      "id": 7489,
      "title": "The History of JSON",
      "description": "JSON has become the world's best loved data interchange format. This is\nthe true story of the discovery of JSON and an explanation of why it is\nthe way it is. Advice to designers of the next standard will be provided.\n<br/><br/>\nEveryone who attends will receive a prize (while supplies last)."
    },
    {
      "id": 7515,
      "title": "Cubes, Hexagons and More: Understanding the Microservices Through Shapes",
      "description": "<p>The microservice architecture is becoming increasing important.<br />But what is it exactly? <br />Why should you care about microservices?<br />And, what do you need to do to ensure that your organization uses the microservice architecture successfully?</p>\n<p>In this talk, I&rsquo;ll answer these and other questions using shapes as visual metaphors.<br />You will learn about the motivations for the microservice architecture and why simply adopting microservices is insufficient.<br />I describe essential characteristics of microservices<br />You will learn how a successful microservice architecture consist of loosely coupled services with stable APIs that communicate asynchronous<br />I cover strategies for effectively testing microservices.</p>"
    },
    {
      "id": 7526,
      "title": "Building Distributed Teams",
      "description": "Practical advice and considerations for how to identify, build, and grow a distributed team.  The talk will cover issues like considerations for identifying a location, recruiting and building a team, effective and efficient communication channels, and ensuring remote offices are set up for success."
    },
    {
      "id": 7531,
      "title": "Introduction to Machine Learning and Artificial Intelligence",
      "description": "This will be a non-intimidating introduction to machine learning, one of the most dominant subjects in technology. We'll talk about what it is, how machines learn, and why it has become so important. We’ll look at why the quantity of data is so important to machine learning and the qualities that the best data should have. We’ll then talk about how a model is trained, and the machine learning process.\n<br/><br/>\nWe’ll also discuss Artificial Intelligence and machine learning’s role in AI. This will be a non-technical introduction, but we'll discuss some of the technology behind AI, including neural networks and deep learning. Specifically, we’ll delve into Convolutional Neural Networks and explore why they’re so good at computer vision tasks. We'll also discuss how machine learning, deep learning, and artificial intelligence are related, and how they differ. We'll conclude by talking about some of the amazing things that AI can do and what it can’t do (yet).\n"
    },
    {
      "id": 7536,
      "title": "Top 10 Ways to Scale Your Website with Redis",
      "description": "Redis has 10 different data structures (String, Hash, List, Set, Sorted Set, Bit Array, Bit Field, Hyperloglog, Geospatial Index, Streams) plus Redis Modules. In this talk, Dave will give at least 1 example of how to use each data structure to scale your website. He will start with the basics, such as a SQL cache and User session management. Then he will demonstrate storing user generated tags, leaderboards and counting things with hyberloglog. He will end with a demo of Redis Streams which can be used to scale your Microservices-based architecture."
    },
    {
      "id": 7537,
      "title": "Critical Agile Practices, Nuanced Techniques",
      "description": "<p>Five techniques that can make our teamwork and our teams dramatically more effective. The nuances I almost never see teams doing (and that have made my teams much more effective) that I coach all my teams in.</p>\n<p>I'm an engineering-team and engineering-org fire-jumper. This is stuff that works for me.</p>\n<p>I've not only seen these techniques work with my teams, but... I'm also the co-author of the Study of Product Team Performance, in which correlations from the thousands of respondents on product teams all over the world have validated the universality of the nuances of two of the techniques I'll be sharing.</p>\n<p>The first four techniques are pretty easy and pretty simple. I've been teaching and coaching managers and teams in all five for 15 years. It's time they get wider visibility, and a wider swath of teams and managers get a shot at leveraging them.</p>"
    },
    {
      "id": 7566,
      "title": "Q&A Panel with Engineering Managers  ",
      "description": "How do I handle an unreasonable boss? What if I don't trust my team to deliver good code? How can I improve your team's attitude about agile? Why do I have so many bugs??? \n<br/>\nIn this unscripted format, speakers from the Management and Agile tracks answer audience questions. Bring your toughest questions about agile, management, leadership, careers, terrible bosses and the pains of moving from Programmer to Manager. \n<br/>\nFeeling shy? Email your question advance to Ron@RonLichty.com"
    },
    {
      "id": 7569,
      "title": "You Can Count on Numbers",
      "description": "Fundamentally, the only thing that computers can do is manipulate\nnumbers. In many ways, the computer's numbers act much like the numbers\nwe were taught in school. But in some (perhaps surprising) ways, they\nbehave very differently. Disastrous bugs have resulted from lack of deep\nunderstanding of the differences. Most programmers are not trained or\neven warned about these differences, making them a danger to themselves\nand others.\n<br/><br/>\nThis talk will look at the nature and history of numbers, with\nrecommendations for how we can make better numbers in the future."
    }
  ],
  "attendees": [
    {
      "id": "109a566c-346f-4449-bab8-3c43658a328c",
      "firstName": "Elyssa",
      "lastName": "Wisoky",
      "email": "Ollie_Kulas-Gibson@hotmail.com"
    },
    {
      "id": "ac7ccfba-3bfd-4467-804a-37824f7fa85f",
      "firstName": "Porter",
      "lastName": "Hodkiewicz",
      "email": "Noelia_Bernhard@hotmail.com"
    },
    {
      "id": "e691977f-c457-46a9-bcaf-12432011e75b",
      "firstName": "Sheldon",
      "lastName": "Wiegand-Cronin",
      "email": "Evert.Considine@gmail.com"
    },
    {
      "id": "91766d1f-3195-4ee0-b89e-14170fd1a02e",
      "firstName": "Amanda",
      "lastName": "Volkman",
      "email": "Guiseppe42@yahoo.com"
    },
    {
      "id": "90fd6dd3-270c-442a-812d-7ae129df0166",
      "firstName": "Kristopher",
      "lastName": "Hartmann",
      "email": "Kaylee62@gmail.com"
    },
    {
      "id": "e711f0b7-5786-4525-9673-da4318e0e11e",
      "firstName": "Beau",
      "lastName": "Huels",
      "email": "Ericka_Johnston@hotmail.com"
    },
    {
      "id": "c98682ca-b95f-49dc-82a4-aea21fa2741e",
      "firstName": "Trey",
      "lastName": "Sanford",
      "email": "Dusty_Bogisich@gmail.com"
    },
    {
      "id": "11c7a977-4c19-4f84-a534-e3c0820c84f8",
      "firstName": "Ashleigh",
      "lastName": "Will",
      "email": "Erick_Considine@gmail.com"
    },
    {
      "id": "7a5f882a-d1bb-4db5-8237-c6cc954edca4",
      "firstName": "Nicklaus",
      "lastName": "Jacobson",
      "email": "Treva_Carter@gmail.com"
    },
    {
      "id": "5fc34d9a-4c5b-4036-96a6-c2e61b5facfc",
      "firstName": "Freddie",
      "lastName": "Anderson",
      "email": "Trey.Keebler98@yahoo.com"
    },
    {
      "id": "b692dcbf-138a-4ae3-a661-5f3c5b7fffcc",
      "firstName": "Dayton",
      "lastName": "Ward",
      "email": "Jacynthe_Dach78@gmail.com"
    },
    {
      "id": "ddb81755-bc9b-403b-9121-2e748213a655",
      "firstName": "Dax",
      "lastName": "Macejkovic",
      "email": "Narciso.Hackett0@hotmail.com"
    },
    {
      "id": "4ad9f076-db7f-4560-a532-42887b58c16b",
      "firstName": "Obie",
      "lastName": "Stokes",
      "email": "Carson_Turner@yahoo.com"
    },
    {
      "id": "8716b46a-aeba-4434-84d0-4ccb8c5ed303",
      "firstName": "Rodrigo",
      "lastName": "Bayer",
      "email": "Christa_Mohr@hotmail.com"
    },
    {
      "id": "d18d9f0d-86f2-4911-ba6f-41e2cacd733d",
      "firstName": "Stephan",
      "lastName": "Borer",
      "email": "Matilda97@yahoo.com"
    }
  ],
  "attendeeFavorites": [
    {
      "attendeeId": "ac7ccfba-3bfd-4467-804a-37824f7fa85f",
      "speakerId": 10808
    },
    {
      "attendeeId": "ac7ccfba-3bfd-4467-804a-37824f7fa85f",
      "speakerId": 10808
    },
    {
      "attendeeId": "ac7ccfba-3bfd-4467-804a-37824f7fa85f",
      "speakerId": 1124
    },
    {
      "attendeeId": "e691977f-c457-46a9-bcaf-12432011e75b",
      "speakerId": 47323
    },
    {
      "attendeeId": "e691977f-c457-46a9-bcaf-12432011e75b",
      "speakerId": 1124
    },
    {
      "attendeeId": "e691977f-c457-46a9-bcaf-12432011e75b",
      "speakerId": 1530
    },
    {
      "attendeeId": "91766d1f-3195-4ee0-b89e-14170fd1a02e",
      "speakerId": 10808
    },
    {
      "attendeeId": "91766d1f-3195-4ee0-b89e-14170fd1a02e",
      "speakerId": 1124
    },
    {
      "attendeeId": "90fd6dd3-270c-442a-812d-7ae129df0166",
      "speakerId": 1124
    },
    {
      "attendeeId": "e711f0b7-5786-4525-9673-da4318e0e11e",
      "speakerId": 1269
    },
    {
      "attendeeId": "e711f0b7-5786-4525-9673-da4318e0e11e",
      "speakerId": 47323
    },
    {
      "attendeeId": "11c7a977-4c19-4f84-a534-e3c0820c84f8",
      "speakerId": 2920
    },
    {
      "attendeeId": "11c7a977-4c19-4f84-a534-e3c0820c84f8",
      "speakerId": 1124
    },
    {
      "attendeeId": "7a5f882a-d1bb-4db5-8237-c6cc954edca4",
      "speakerId": 1269
    },
    {
      "attendeeId": "7a5f882a-d1bb-4db5-8237-c6cc954edca4",
      "speakerId": 1269
    },
    {
      "attendeeId": "5fc34d9a-4c5b-4036-96a6-c2e61b5facfc",
      "speakerId": 10808
    },
    {
      "attendeeId": "5fc34d9a-4c5b-4036-96a6-c2e61b5facfc",
      "speakerId": 8590
    },
    {
      "attendeeId": "5fc34d9a-4c5b-4036-96a6-c2e61b5facfc",
      "speakerId": 1124
    },
    {
      "attendeeId": "b692dcbf-138a-4ae3-a661-5f3c5b7fffcc",
      "speakerId": 47323
    },
    {
      "attendeeId": "b692dcbf-138a-4ae3-a661-5f3c5b7fffcc",
      "speakerId": 1124
    },
    {
      "attendeeId": "b692dcbf-138a-4ae3-a661-5f3c5b7fffcc",
      "speakerId": 187
    },
    {
      "attendeeId": "ddb81755-bc9b-403b-9121-2e748213a655",
      "speakerId": 10808
    },
    {
      "attendeeId": "4ad9f076-db7f-4560-a532-42887b58c16b",
      "speakerId": 10808
    },
    {
      "attendeeId": "8716b46a-aeba-4434-84d0-4ccb8c5ed303",
      "speakerId": 187
    },
    {
      "attendeeId": "d18d9f0d-86f2-4911-ba6f-41e2cacd733d",
      "speakerId": 1124
    }
  ]
}
